{
    "faq-bro-UGm22plF": {
        "q": "Is the movement required on Brogan's Gold?",
        "a": "Yes. Unless otherwise indicated, card text is mandatory. Brogan must move into the space where the target was, if he is able to (if it is empty).\n- Note: generally the space will be empty if he defeated the target, but several primary defense cards, like Cutter’s Silver (_Grappling Bolt_) and Swift’s Alt Blue (_Tactical Jump_), may move the target out of the space, allowing (requiring) Brogan to move into it.",
        "ref": ["bro-gold", "bro-gold-h"]
    },
    "faq-bro-2Mz0rGtI": {
        "q": "Why would I want to retrieve Brogan’s Silver? Doesn’t this do nothing?",
        "a": "In Guards of Atlantis, your cards are also your health. Retrieving Brogan’s Silver makes him more resilient to attacks and discard effects later in the round.",
        "ref": ["bro-silver"]
    },
    "faq-bro-jMK17229": {
        "q": "What’s the difference between “moved” and forced to move” on Brogan’s Silver?",
        "a": "“Force to move” is an effect that says “an enemy hero moves X” (and you would normally choose). “Moved” is an effect that says “move an enemy hero X” (and the opponent who played the effect would choose how to move you).",
        "ref": ["bro-silver"]
    },
    "faq-bro-fbDz04ez": {
        "q": "Does Brogan’s Primary Red attack require movement?",
        "a": "Yes! If Brogan cannot move 2 spaces in a straight line to a space adjacent to an enemy unit, the effect will “fizzle” — stop resolving — and he will not attack. A crafty opponent can anticipate and deny this attack with clever positioning.\n- Brogan can charge next to an immune unit, at which point his attack would fizzle.\n- Brogan can charge through Min’s Smoke Bomb Token, since the Smoke Bomb only prevents targeting across the Smoke Bomb and Brogan would not target until after the movement.",
        "ref": ["bro-red-i", "bro-red-ii", "bro-red-iii"]
    },
    "faq-bro-U8USFZ6w": {
        "q": "Does Brogan’s Primary Green work during Minion Battle?",
        "a": "No. Minions are not “defeated” in Minion Battle, they are removed.",
        "ref": ["bro-green-i", "bro-green-ii", "bro-green-iii"]
    },
    "faq-bro-6XDWvftE": {
        "q": "Can Brogan’s Alernative Blue target a Hero who has played an attack card but not attacked?",
        "a": "Yes: it only checks for Heroes that “played” an attack card, regardless of whether they’ve resolved the action, which action they performed, and even whether this is still their card for the turn (it will “remember” whether they have played a card, even if it is discarded or switched for another card by an effect).",
        "ref": ["bro-blue-ii-alt", "bro-blue-iii-alt"]
    }
}
