{
    "faq-dod-DYMXRSjX": {
        "q": "What is an “empty minion spawn point in the battle zone”?",
        "a": "Dodger’s magic (thematically) grows stronger as minions are defeated. Many of her cards check for “empty minion spawn points in the battle zone.” These are the minion spawn points printed on the board, but only the ones in the current battle zone — there is only 1 battle zone (2, on the 2-lane map). Only empty spaces (with **nothing** on them) are counted.",
        "ref": [
            "dod-silver",
            "dod-gold",
            "dod-gold-h",
            "dod-green-i",
            "dod-green-ii",
            "dod-green-iii",
            "dod-blue-i",
            "dod-blue-ii",
            "dod-blue-iii"
        ]
    },
    "faq-dod-36mZD5jZ": {
        "q": "Why and how would Dodger remove her own friendly minions?",
        "a": "Several of Dodger’s cards become more powerful with empty minion spawn points near her. Some of her cards allow her to remove her own friendly minions, which helps her achieve this more quickly (and may remove a minion that an opponent will soon defeat anyway). Removing a friendly minion does _not_ earn Dodger coins. Heroes can never **attack** their own friendly units.",
        "ref": [
            "dod-silver",
            "dod-green-i",
            "dod-green-ii",
            "dod-green-iii",
            "dod-blue-ii",
            "dod-blue-iii"
        ]
    },
    "faq-dod-uU82U9DL": {
        "q": "When does Dodger’s Tier III Primary Red card prevent retrieval?",
        "a": "As soon as the unit is targeted. If a hero defended with a defense action that retrieves a card, they would not be able to retrieve the card.",
        "ref": [
            "dod-red-iii"
        ]
    },
    "faq-dod-73Ipv84g": {
        "q": "When Dodger uses another card’s action with her Alt Blue cards, what weird things can happen?",
        "a": "Here are some possibilities:\n- Active effects Dodger copies will work normally. The effect remains, even if the originally copied card changes state or the hero is defeated.\n- If Dodger copies cards that specifically refer to Tokens, she uses those tokens as those heroes would (such as Min’s grenade or smoke bomb, or Wuk’s trees).\n- However, when placing Tokens with special properties, the properties are still defined by the originating Hero’s card, since Heroes do not “own” Tokens. The two big examples are that Tali’s Alt Green (_Glacial Barrier_) places a Token that has an Initiative penalty to Tali’s enemies (not Dodger’s), and Min’s Blue (_Trip Mine_) places Mines as Dodger chooses, but they would force discards against Min’s enemies (not Dodger’s). So, probably don’t copy these cards.\n- Dodger can copy Trinkets’ cards to remove and/or place the Turret.\n- If Dodger copies an action that says “this card”, it means the card with the printed ability, not Dodger’s. She cannot copy Brogan’s Silver (_Bullwark_), for example, then retrieve her card.\n- Dodger’s Alt Blue is a skill card, so some card resolutions may happen differently. Examples:\n  - If Dodger copies a non-ranged attack, she is performing a non-ranged attack (even though her Blue card is an area-skill).\n  - If Dodger copies an attack and Bain blocks with his Primary Green (_Close Call_), Dodger would not pick up her Blue card, since she is not playing an attack card.\n  - If Dodger copies Trinkets’ Primary Red (_Makeshift Minigun_), she will gain a range bonus. If she is subsequently hit by Wasp’s Gold (_Dazzling Dagger_), the active +range bonus copied from Trinkets is canceled).\n- If Dodger copies Xargatha’s Green (_Charming Aura_), both heroes may try to “convert” the surrounding minions: these are resolved starting with the team shown on the tie-breaker coin, without flipping it (see Rulebook, p. 18). This means that the tiebreaker coin team may convert several minions to friendly, then the non-tiebreaker team may convert them back, as well as any others that were already enemies.\n- Dodger cannot copy the card of an immune hero.",
        "ref": [
            "dod-blue-ii-alt",
            "dod-blue-iii-alt"
        ],
        "sources": [
            "rulebook:p18"
        ]
    },
    "faq-dod-uF7N41Hk": {
        "q": "If Dodger removes her friendly Heavy Minion with her Primary Green card, which happens first, the push or a chance to collect a coin?",
        "a": "Pushing the Lane happens immediately, even in the middle of an action. If Dodger is down to only the Heavy Minion for her team and she plays her Primary Green, she would be able to remove the Heavy (since it is no longer immune), would not collect coins (it is removing, not defeating), and the Lane would immediately Push. This means the “Battle Zone” has now shifted to the new zone, which does not have empty minion spawn points, so she will not normally be able to collect a coin from the effect on her card.",
        "ref": [
            "dod-green-ii-alt",
            "dod-green-iii-alt"
        ]
    },
    "faq-dod-9oAe2b05": {
        "q": "What minions can Dodger respawn with her Alternative Green card?",
        "a": "She can return a friendly defeated/removed minion of any type to any spawn point. \n- It need not be a matching minion type or color: if her friendly ranged minion is defeated, Dodger could respawn it on an enemy melee minion spawn point. \n- It must be a minion that was originally in play in this wave, before being defeated or removed. Dodger cannot “respawn” a minion that was not originally in play at the start of the wave.\n - She must respawn a minion directly onto a spawn point. She cannot respawn the minion on a space adjacent to the spawn point. Note that this is different than respawning minions after the lane pushes.",
        "ref": [
            "dod-green-ii-alt",
            "dod-green-iii-alt"
        ]
    }
}