{
    "faq-wasp-W273D7Gg": {
        "q": "How does Wasp’s Gold card work?",
        "a": "After attacking, any enemy Heroes adjacent to you cancel their active effects. Active effects have bold text saying “Next turn:”, “This round:”, etc. and are turned sideways. This includes Active effects that are not yet in effect (for example, Min’s Alt Blue, (_Death Grenade_), is an “End of turn:” Active effect that would still be canceled and not happen). Additionally, for the rest of the turn, enemy Heroes next to you cannot perform skill actions (the primary action on skill cards). This is checked on their turn, so if the Hero is no longer adjacent to you, they would be able to perform skill actions again.\n• Wasp’s Gold can “interrupt” a skill that moves a hero next to Wasp (like Tigerclaw’s Primary Green, _Master Thief_): they will not be able to perform the rest of the action.",
        "ref": ["was-gold", "was-gold-h"]
    },
    "faq-wasp-P8qD2hsM": {
        "q": "How does Wasp’s Silver card work?",
        "a": "Static Barrier divides the map into 2 regions: spaces within its radius and outside its radius. Enemy units cannot **move** or **fast travel** across the “barrier” between the two regions:\n- ❌They **cannot** take a move action (to move or fast travel) to move across the barrier.\n- ❌They **cannot** use an attack or skill involving movement to cross the barrier.\n- ❌They **cannot** cross the barrier on their path, even if they cross back. That is, a hero outside the barrier cannot walk into the radius and then walk back out.\n- ✅They **can** use a “place” or “swap” effect (such as Arien’s Alt Blue) to cross the barrier.\n- ✅They **can** be pushed across the barrier (pushing is not movement) or moved by another player’s card.",
        "ref": ["was-silver"]
    },
    "faq-wasp-iOUfdU2P": {
        "q": "How do Wasp’s Primary Blue cards move units and tokens?",
        "a": "The target cannot move farther away or closer, so the distance between you and the target must remain unchanged.",
        "ref": ["was-blue-i", "was-blue-ii", "was-blue-iii"]
    },

    "faq-wasp-6LS6R1fC": {
        "q": "When does Wasp’s Alternative Blue cards force a discard?",
        "a": "This card pushes adjacent enemies away from you (in a straight line). If an enemy Hero cannot be pushed the full distance, because an obstacle is located along the straight line path, the Hero is forced to discard.",
        "ref": ["was-blue-ii-alt", "was-blue-iii-alt"]
    },
    "faq-wasp-uCXB6YGe": {
        "q": "Why do Wasp’s Tier II and III Primary Green cards say “If you do”? Why would the block fail?",
        "a": "You can always discard a card to attempt to Defend, even if it does not Defend successfully. In this case, the Block’s condition must be met (the attacker is not adjacent) in order to apply the second half of the card (forcing the attacker to discard).",
        "ref": ["was-green-ii", "was-green-iii"]
    }
}
